In [56]:
import pandas as pd

In [57]:
raw_data = {
         "city": ["Tripoli", "Sydney", "Tripoli", "Rome", "Rome", "Tripoli","Rome", "Sydney", "Sydney"],
         "rank": ["1st", "2nd", "1st", "2nd", "1st", "2nd","1st", "2nd", "1st"], 
         "score1": [44, 48, 39, 41, 38, 44, 34, 54, 61],
         "score2": [67, 63, 55, 70, 64, 77, 45, 66, 72]
        }
        
df = pd.DataFrame(raw_data, 
                  index = pd.Index(['A','B','C','D','E','F','G','H','I'], name='letter'),
                  columns = pd.Index(['city', 'rank','score1','score2'],name='attributes'))
#df

In [58]:
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
D              Rome  2nd      41      70
E              Rome  1st      38      64
F           Tripoli  2nd      44      77
G              Rome  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

In [70]:
# Here we create a grouping object:
# this object represents the particular grouping that we want.
# Let's group the dataframe by city
dict(list(df.groupby(['city','rank'])))

{('Rome', '1st'): attributes  city rank  score1  score2
 letter
 E           Rome  1st      38      64
 G           Rome  1st      34      45,
 ('Rome', '2nd'): attributes  city rank  score1  score2
 letter
 D           Rome  2nd      41      70,
 ('Sydney', '1st'): attributes    city rank  score1  score2
 letter
 I           Sydney  1st      61      72,
 ('Sydney', '2nd'): attributes    city rank  score1  score2
 letter
 B           Sydney  2nd      48      63
 H           Sydney  2nd      54      66,
 ('Tripoli', '1st'): attributes     city rank  score1  score2
 letter
 A           Tripoli  1st      44      67
 C           Tripoli  1st      39      55,
 ('Tripoli', '2nd'): attributes     city rank  score1  score2
 letter
 F           Tripoli  2nd      44      77}

In [68]:
dict(list(df['city'].groupby(df['rank'])))['1st']

letter
A    Tripoli
C    Tripoli
E       Rome
G       Rome
I     Sydney
Name: city, dtype: object

In [99]:
df

attributes     city rank  score1  score2
letter
A           Tripoli  1st      44      67
B            Sydney  2nd      48      63
C           Tripoli  1st      39      55
D              Rome  2nd      41      70
E              Rome  1st      38      64
F           Tripoli  2nd      44      77
G              Rome  1st      34      45
H            Sydney  2nd      54      66
I            Sydney  1st      61      72

In [107]:
list(df['score1'].groupby([df['city'],df['rank']]))

[(('Rome', '1st'), letter
  E    38
  G    34
  Name: score1, dtype: int64), (('Rome', '2nd'), letter
  D    41
  Name: score1, dtype: int64), (('Sydney', '1st'), letter
  I    61
  Name: score1, dtype: int64), (('Sydney', '2nd'), letter
  B    48
  H    54
  Name: score1, dtype: int64), (('Tripoli', '1st'), letter
  A    44
  C    39
  Name: score1, dtype: int64), (('Tripoli', '2nd'), letter
  F    44
  Name: score1, dtype: int64)]

In [108]:
df['score1'].groupby([df['city'],df['rank']]).median()

city     rank
Rome     1st     36.0
         2nd     41.0
Sydney   1st     61.0
         2nd     51.0
Tripoli  1st     41.5
         2nd     44.0
Name: score1, dtype: float64

In [111]:
import numpy as np
df.groupby('city').apply(lambda x: np.mean(np.log2(x['score1'])))

city
Rome       5.230981
Sydney     5.756862
Tripoli    5.401422
dtype: float64